Revit 2027 API
BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReinforcement Property
 Can't find a host for Area Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceAreaReinforcement { get; }
Public Shared ReadOnly Property CannotPlaceAreaReinforcement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceAreaReinforcement {
	FailureDefinitionId^ get ();
}
static member CannotPlaceAreaReinforcement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace